[
  {
    "id": 1,
    "name": "JavaScript",
    "description": "A versatile, high-level programming language essential for web development, JavaScript enables dynamic content, user interactions, and responsive design. Widely used in front-end development and also supported on the server side with Node.js."
  },
  {
    "id": 2,
    "name": "React",
    "description": "A powerful JavaScript library developed by Facebook, React is used for building interactive user interfaces. It allows developers to create reusable components, making web applications more efficient and easier to manage."
  },
  {
    "id": 3,
    "name": "React Native",
    "description": "An open-source framework by Facebook, React Native allows developers to build mobile applications using JavaScript and React principles, offering a unified experience across iOS and Android with native performance."
  },
  {
    "id": 4,
    "name": "C",
    "description": "A foundational language in computer science, C is known for its efficiency and control over system resources. It is commonly used in system programming, embedded systems, and applications requiring high performance."
  },
  {
    "id": 5,
    "name": "C++",
    "description": "An extension of C, C++ offers object-oriented capabilities and is widely used in software that demands high performance, such as games, operating systems, and real-time simulation applications."
  },
  {
    "id": 6,
    "name": "C#",
    "description": "Developed by Microsoft, C# is a robust language for building applications on the .NET framework, especially suited for Windows applications, enterprise software, and game development with Unity."
  },
  {
    "id": 7,
    "name": "Java",
    "description": "A widely-used, object-oriented programming language, Java is platform-independent and ideal for developing secure, large-scale applications, including Android apps, web servers, and enterprise solutions."
  },
  {
    "id": 8,
    "name": "TypeScript",
    "description": "A typed superset of JavaScript, TypeScript enhances JavaScript by adding static typing, making code more predictable and maintainable. It’s particularly popular in large codebases and enterprise projects."
  },
  {
    "id": 9,
    "name": "Python",
    "description": "Known for its readability and ease of use, Python is a versatile programming language popular in data science, web development, automation, and artificial intelligence. Its extensive libraries make it ideal for rapid development."
  },
  {
    "id": 10,
    "name": "Django",
    "description": "A high-level Python web framework, Django promotes rapid development and clean design. It includes a range of built-in features for security, scalability, and ease of use, making it a preferred choice for backend development."
  }
]
