[
  {
    "category_id": 1,
    "name": "Introduction",
    "description": "JavaScript is a versatile programming language commonly used to add interactivity to websites.",
    "tutorials": [
      {
        "id": 1,
        "title": "Getting Started with JavaScript",
        "content": "<p><strong>An introduction to JavaScript basics</strong>, covering essential topics such as <em>variables</em>, <em>functions</em>, and <em>data types</em>. You'll learn to create interactive web elements and understand the foundations of JavaScript programming.</p>"
      },
      {
        "id": 2,
        "title": "JavaScript and the DOM",
        "content": "<p>Discover how JavaScript interacts with the <strong>Document Object Model (DOM)</strong> to <em>manipulate</em> and <em>update web content dynamically</em>. This tutorial will help you build responsive pages that react to user inputs and actions.</p>"
      }
    ]
  },
  {
    "category_id": 1,
    "name": "Advanced",
    "description": "This section covers advanced topics in JavaScript for experienced developers.",
    "tutorials": [
      {
        "id": 3,
        "title": "Async Programming with Promises",
        "content": "<p>Delve into <strong>asynchronous programming</strong> in JavaScript using <em>promises</em> and the <code>async/await</code> syntax. Understand how to handle asynchronous operations, such as <em>API requests</em>, efficiently to avoid <strong>callback hell</strong>.</p>"
      },
      {
        "id": 4,
        "title": "JavaScript Modules and Imports",
        "content": "<p>Learn about <strong>JavaScript modules</strong> for organizing code into reusable components. This tutorial covers module syntax, <code>import</code> and <code>export</code> statements, and best practices for structuring larger JavaScript applications.</p>"
      }
    ]
  },
  {
    "category_id": 2,
    "name": "Introduction",
    "description": "React is a JavaScript library for building user interfaces using reusable components.",
    "tutorials": [
      {
        "id": 5,
        "title": "Getting Started with React",
        "content": "<p>Learn how to <strong>set up your first React project</strong> and explore the basics of <em>components</em> and <em>JSX syntax</em>. You’ll understand the core principles of React and how to create interactive UI components.</p>"
      }
    ]
  },
  {
    "category_id": 2,
    "name": "Advanced",
    "description": "Advanced React concepts including hooks, context, and performance optimization.",
    "tutorials": [
      {
        "id": 6,
        "title": "State Management with Redux",
        "content": "<p>Implement <strong>Redux</strong> for effective state management in large React applications. Learn about <em>actions</em>, <em>reducers</em>, and the <code>store</code> to manage complex app states.</p>"
      },
      {
        "id": 7,
        "title": "React Performance Optimization",
        "content": "<p>Optimize your React applications with techniques like <strong>memoization</strong> and <em>lazy loading</em>. This tutorial dives into methods to improve app speed and user experience by minimizing rendering.</p>"
      }
    ]
  },
  {
    "category_id": 3,
    "name": "Introduction",
    "description": "React Native enables developers to build cross-platform mobile apps using JavaScript and React.",
    "tutorials": [
      {
        "id": 8,
        "title": "Setting Up a React Native Project",
        "content": "<p>Get started with <strong>React Native</strong> by learning the initial setup process. This tutorial will guide you through installing tools, creating a new project, and preparing your environment for mobile app development.</p>"
      },
      {
        "id": 9,
        "title": "Understanding React Native Components",
        "content": "<p>Explore the fundamental <strong>React Native components</strong> and learn how to style and layout your mobile app interface effectively. This is an essential guide for designing responsive mobile applications.</p>"
      }
    ]
  },
  {
    "category_id": 4,
    "name": "Introduction",
    "description": "C is a low-level programming language known for its efficiency and use in systems programming.",
    "tutorials": [
      {
        "id": 10,
        "title": "Basic Syntax in C",
        "content": "<p>Master the <strong>syntax</strong> and structure of the <em>C programming language</em>, focusing on essential concepts such as <code>data types</code>, <code>variables</code>, and <em>control statements</em>.</p>"
      }
    ]
  },
  {
    "category_id": 5,
    "name": "Introduction",
    "description": "C++ builds on C with additional features like object-oriented programming.",
    "tutorials": [
      {
        "id": 11,
        "title": "Introduction to C++ and Classes",
        "content": "<p>Begin your <strong>C++ journey</strong> with an introduction to <em>classes</em> and <em>objects</em>, which are fundamental to object-oriented programming. Learn how to structure data and behaviors in reusable code components.</p>"
      }
    ]
  },
  {
    "category_id": 5,
    "name": "Advanced",
    "description": "Advanced C++ topics for more efficient and powerful programming.",
    "tutorials": [
      {
        "id": 12,
        "title": "Memory Management in C++",
        "content": "<p>Learn to handle <strong>memory management</strong> in C++ effectively with a focus on <em>pointers</em>, <em>dynamic memory allocation</em>, and <code>delete</code> operations.</p>"
      }
    ]
  },
  {
    "category_id": 6,
    "name": "Introduction",
    "description": "C# is a modern, object-oriented programming language developed by Microsoft.",
    "tutorials": [
      {
        "id": 13,
        "title": "Getting Started with C#",
        "content": "<p>Begin programming in <strong>C#</strong> by learning about <em>syntax</em> and basic programming concepts such as <code>variables</code>, <code>loops</code>, and <code>conditions</code>.</p>"
      },
      {
        "id": 14,
        "title": "Classes and Objects in C#",
        "content": "<p>Dive into <strong>object-oriented programming</strong> with C#. Learn to create and use <em>classes</em> and <em>objects</em> in your applications for a modular and reusable codebase.</p>"
      }
    ]
  },
  {
    "category_id": 7,
    "name": "Introduction",
    "description": "Java is a widely-used programming language known for its portability and performance.",
    "tutorials": [
      {
        "id": 15,
        "title": "Setting Up a Java Development Environment",
        "content": "<p>Set up your <strong>Java development environment</strong> by installing the necessary tools. This tutorial will guide you through configuring your IDE and compiling your first Java program.</p>"
      },
      {
        "id": 16,
        "title": "Basic Syntax in Java",
        "content": "<p>Understand the core syntax of <strong>Java</strong>, including <em>classes</em>, <em>methods</em>, and <code>access modifiers</code> to begin developing Java applications.</p>"
      }
    ]
  },
  {
    "category_id": 7,
    "name": "Advanced",
    "description": "Advanced Java topics including multithreading and concurrency.",
    "tutorials": [
      {
        "id": 17,
        "title": "Java Multithreading",
        "content": "<p>Implement <strong>multithreading</strong> in Java to run multiple tasks concurrently. This tutorial will cover the <em>Thread</em> class, <em>Runnable</em> interface, and thread management techniques.</p>"
      }
    ]
  },
  {
    "category_id": 8,
    "name": "Introduction",
    "description": "TypeScript is a superset of JavaScript that adds static typing to enhance code reliability.",
    "tutorials": [
      {
        "id": 18,
        "title": "Getting Started with TypeScript",
        "content": "<p>Get started with <strong>TypeScript</strong> and learn about <em>typed variables</em> and <em>functions</em>. Understand how TypeScript helps prevent errors and improve code maintainability.</p>"
      }
    ]
  },
  {
    "category_id": 9,
    "name": "Introduction",
    "description": "Python is a versatile programming language with applications in web development, data science, and automation.",
    "tutorials": [
      {
        "id": 19,
        "title": "Python Basics",
        "content": "<p>Learn the essentials of <strong>Python programming</strong>, including <em>syntax</em>, <code>data types</code>, and <em>control structures</em>. This tutorial serves as the foundation for Python development.</p>"
      }
    ]
  },
  {
    "category_id": 9,
    "name": "Advanced",
    "description": "Advanced Python topics for data manipulation and web development.",
    "tutorials": [
      {
        "id": 20,
        "title": "Data Analysis with Pandas",
        "content": "<p>Master <strong>data analysis</strong> in Python using the <em>Pandas</em> library. This guide covers data manipulation techniques and analysis workflows essential for data-driven applications.</p>"
      },
      {
        "id": 21,
        "title": "Building REST APIs with Flask",
        "content": "<p>Build <strong>RESTful APIs</strong> using <em>Flask</em>, a lightweight web framework in Python. This tutorial walks through creating and deploying APIs to power web applications.</p>"
      }
    ]
  },
  {
    "category_id": 10,
    "name": "Introduction",
    "description": "Django is a high-level Python framework for rapid web development.",
    "tutorials": [
      {
        "id": 22,
        "title": "Setting Up a Django Project",
        "content": "<p>Set up your first <strong>Django project</strong> by installing the framework and creating a basic application structure. This guide covers initial setup and essential configurations.</p>"
      },
      {
        "id": 23,
        "title": "Understanding Django Models",
        "content": "<p>Explore <strong>Django models</strong> to define and structure database schemas. This tutorial introduces the Model-View-Template (MVT) architecture and handling database migrations.</p>"
      }
    ]
  }
]
